---
kind: other
id: Methods.T:Autodesk.Revit.UI.IFrameworkElementCreator
source: html/9c47e73d-b907-2312-ad4b-7d993a427aa2.htm
---
# IFrameworkElementCreator Methods

Method called to create the FrameworkElement.